[
  {
    "Product Name": "Butyl Glycol",
    "ID": "butyl-glycol",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS, PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "butyl-glycol.jpg",
    "Description": "Butyl Glycol, also known as 2-butoxyethanol, is a colorless liquid with a mild ether-like odor. It serves as a solvent in paints, coatings, inks, and cleaning products due to its ability to dissolve both water-soluble and oil-based substances. It is also used in detergents and cosmetics as a coupling agent and stabilizer.",
    "Safety Notice": "Harmful if swallowed, inhaled, or in contact with skin. Causes eye and skin irritation. Use in well-ventilated areas with gloves and eye protection. Rinse with water if contacted. Dispose of per local regulations.",
    "Source Country": "India"
  },
  {
    "Product Name": "CAPB",
    "ID": "capb",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "capb.jpeg",
    "Description": "Cocamidopropyl Betaine (CAPB) is a mild amphoteric surfactant derived from coconut oil. It is used in shampoos, body washes, and detergents for its foaming, cleansing, and conditioning properties, enhancing viscosity and stability in formulations.",
    "Safety Notice": "May cause skin or eye irritation in concentrated form. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children.",
    "Source Country": "India"
  },
  {
    "Product Name": "Calcium Hypochlorite",
    "ID": "calcium-hypochlorite",
    "Brand Name": "Dodhia, Aquatic",
    "Category": "DETERGENT/COSMETICS CHEMICALS, FOOD/BEVERAGE/BREWERY CHEMICALS, WATER TREATMENT CHEMICALS",
    "Image Path": "calcium-hypochlorite.webp",
    "Description": "Calcium Hypochlorite is a white, granular or tablet-form disinfectant and bleaching agent. It is used in water treatment for swimming pools and drinking water, and in food processing for sanitization, effectively eliminating bacteria and pathogens.",
    "Safety Notice": "Strong oxidizer. May cause fire or explosion with combustibles. Harmful if swallowed or inhaled. Causes severe burns and eye damage. Wear protective gear. Store away from flammable materials. Dispose of per local regulations.",
    "Source Country": "India"
  },
  {
    "Product Name": "Caustic Soda 99%",
    "ID": "caustic-soda-99",
    "Brand Name": "Unioin",
    "Category": "DETERGENT/COSMETICS CHEMICALS, FOOD/BEVERAGE/BREWERY CHEMICALS, TANNERY/SHOES CHEMICALS, WATER TREATMENT CHEMICALS, TEXTILE CHEMICALS",
    "Image Path": "caustic-soda-99.webp",
    "Description": "Caustic Soda 99% (Sodium Hydroxide) is a versatile alkali used in soaps, detergents, food processing, water treatment, textile production, and leather tanning. Its strong alkaline properties aid in neutralizing acids and cleaning.",
    "Safety Notice": "Highly corrosive. Causes severe burns and eye damage. Harmful if swallowed or inhaled. Wear protective gear and use in well-ventilated areas. Rinse with water if contacted. Store away from acids and moisture.",
    "Source Country": "Dubai"
  },
  {
    "Product Name": "CDEA",
    "ID": "cdea",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "cdea.jpg",
    "Description": "Coconut Diethanolamide (CDEA) is a non-ionic surfactant from coconut oil, used in shampoos, liquid soaps, and detergents as a foam booster, thickener, and stabilizer, enhancing texture and viscosity in formulations.",
    "Safety Notice": "May cause skin or eye irritation in concentrated form. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": "Indonesia"
  },
  {
    "Product Name": "Ceramic and Other Floor Cleaner",
    "ID": "ceramic-and-other-floor-cleaner",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "ceramic-and-other-floor-cleaner.png",
    "Description": "Ceramic and Other Floor Cleaner is a specialized solution for ceramic, porcelain, and hard floor surfaces. It removes dirt, grease, and stains, leaving a streak-free shine, suitable for household and industrial use.",
    "Safety Notice": "May cause eye irritation. Avoid eye and prolonged skin contact. Wear gloves during use. Rinse eyes with water if contacted. Keep out of reach of children. Do not mix with other cleaners unless specified.",
    "Source Country": "China"
  },
  {
    "Product Name": "Citric Acid",
    "ID": "citric-acid",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS, FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "citric-acid.webp",
    "Description": "Citric Acid is a weak organic acid used as a natural preservative and flavor enhancer in food and beverages. In detergents and cosmetics, it acts as a pH adjuster and chelating agent, removing limescale and stains.",
    "Safety Notice": "May cause eye or skin irritation in concentrated form. Avoid inhaling dust or eye contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "CMC",
    "ID": "cmc",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS, FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "cmc.png",
    "Description": "Carboxymethyl Cellulose (CMC) is a water-soluble polymer used as a thickener and stabilizer in detergents, cosmetics, and food products. It enhances texture and prevents ingredient separation in toothpastes, shampoos, and emulsions.",
    "Safety Notice": "May cause eye or skin irritation as powder. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area away from moisture.",
    "Source Country": "China"
  },
  {
    "Product Name": "Coco Diethyl Amide",
    "ID": "coco-diethyl-amide",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "coco-diethyl-amide.webp",
    "Description": "Coco Diethyl Amide, a non-ionic surfactant, is used in personal care products and detergents as a foam booster, thickener, and emulsifier, improving the texture and stability of shampoos, body washes, and cleaners.",
    "Safety Notice": "May cause skin or eye irritation in concentrated form. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Color Additives",
    "ID": "color-additives",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "color-additives.webp",
    "Description": "Color Additives are synthetic or natural dyes used to enhance the visual appeal of detergents, cosmetics, and personal care products. They provide vibrant, consistent coloration in soaps, shampoos, and cleaning products.",
    "Safety Notice": "May cause skin or eye irritation. Avoid contact with concentrated forms. Wear gloves and eye protection. Test for allergies before use. Store in a cool, dry place away from heat.",
    "Source Country": ""
  },
  {
    "Product Name": "Dolomite",
    "ID": "dolomite",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "dolomite.jpg",
    "Description": "Dolomite, a calcium magnesium carbonate mineral, is used in detergents and cosmetics as a filler, abrasive, or pH buffer. Its mild abrasive properties aid in removing tough stains in cleaning products.",
    "Safety Notice": "May cause respiratory irritation if inhaled as dust. Avoid inhalation and prolonged skin contact. Wear gloves, eye protection, and a dust mask. Move to fresh air if inhaled. Store in a dry area.",
    "Source Country": "Local"
  },
  {
    "Product Name": "EDTA",
    "ID": "edta",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "edta.webp",
    "Description": "Ethylenediaminetetraacetic Acid (EDTA) is a chelating agent used in detergents and cosmetics to bind metal ions, improving stability and efficacy. It prevents water hardness from affecting cleaning performance in soaps and shampoos.",
    "Safety Notice": "May cause skin or eye irritation in concentrated form. Avoid prolonged contact or dust inhalation. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place.",
    "Source Country": "China"
  },
  {
    "Product Name": "Fragrance/Perfume",
    "ID": "fragrance-perfume",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "fragrance-perfume.webp",
    "Description": "Fragrance/Perfume is a blend of aromatic compounds used to add pleasant scents to detergents, soaps, and cosmetics. It enhances the sensory experience of personal care and household products with long-lasting fragrances.",
    "Safety Notice": "May cause skin or respiratory irritation in sensitive individuals. Avoid contact with concentrated forms. Wear gloves. Test for allergies before use. Store away from heat and flames.",
    "Source Country": "China"
  },
  {
    "Product Name": "Glycerin",
    "ID": "glycerin",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "glycerin.jpg",
    "Description": "Glycerin, also known as glycerol, is a humectant and moisturizing agent used in cosmetics, soaps, and detergents. It retains moisture, enhances smoothness, and improves skin feel in personal care products.",
    "Safety Notice": "May cause mild skin irritation in concentrated form. Avoid eye contact. Wear gloves during handling. Rinse eyes with water if contacted. Store in a cool, dry place away from heat.",
    "Source Country": "China"
  },
  {
    "Product Name": "Hydrogen Peroxide 50%",
    "ID": "hydrogen-peroxide-50",
    "Brand Name": "Melkasa",
    "Category": "DETERGENT/COSMETICS CHEMICALS, FOOD/BEVERAGE/BREWERY CHEMICALS, TEXTILE CHEMICALS",
    "Image Path": "hydrogen-peroxide-50.webp",
    "Description": "Hydrogen Peroxide 50% is a powerful oxidizer used as a bleaching agent and disinfectant in detergents, textiles, and food processing. It removes stains, whitens fabrics, and sanitizes surfaces effectively.",
    "Safety Notice": "Strong oxidizer. Causes severe burns and eye damage. Harmful if swallowed or inhaled. Wear protective gear. Use in well-ventilated areas. Store away from flammable materials. Dispose of per local regulations.",
    "Source Country": "Local"
  },
  {
    "Product Name": "Industrial Salt",
    "ID": "industrial-salt",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS, FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "industrial-salt.jpg",
    "Description": "Industrial Salt (Sodium Chloride) is used in detergents, food processing, and water treatment as a filler, stabilizer, or processing aid. It supports soap production and food preservation processes.",
    "Safety Notice": "May cause eye or skin irritation in large quantities. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "Local"
  },
  {
    "Product Name": "Iso Propanol Alcohol (IPA)",
    "ID": "iso-propanol-alcohol-ipa",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "iso-propanol-alcohol-ipa.webp",
    "Description": "Isopropyl Alcohol (IPA) is a solvent used in detergents, cosmetics, and disinfectants. Its fast-evaporating and antimicrobial properties make it effective for cleaning surfaces and removing oils.",
    "Safety Notice": "Highly flammable. Causes eye irritation and may cause dizziness if inhaled. Use in well-ventilated areas with gloves and eye protection. Keep away from heat and flames. Rinse with water if contacted.",
    "Source Country": "China"
  },
  {
    "Product Name": "LABSA 96%",
    "ID": "labsa-96",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "labsa-96.webp",
    "Description": "Linear Alkylbenzene Sulfonic Acid (LABSA) 96% is an anionic surfactant used in detergents, dishwashing liquids, and industrial cleaners. It offers excellent cleaning, foaming, and emulsifying properties.",
    "Safety Notice": "Corrosive. Causes severe burns and eye damage. Harmful if swallowed. Wear protective gear. Use in well-ventilated areas. Rinse with water if contacted and seek medical attention. Store away from moisture.",
    "Source Country": "Dubai"
  },
  {
    "Product Name": "Laundry Soaps",
    "ID": "laundry-soaps",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "laundry-soaps.webp",
    "Description": "Laundry Soaps are formulated for washing clothes, containing surfactants, builders, and enzymes to remove dirt, stains, and odors. Available in bar or powder form, they are suitable for hand or machine washing.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged skin contact or eye exposure. Wear gloves during use. Rinse eyes with water if contacted. Keep out of reach of children. Do not ingest.",
    "Source Country": ""
  },
  {
    "Product Name": "Liquid Detergent",
    "ID": "liquid-detergent",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "liquid-detergent.jpg",
    "Description": "Liquid Detergent is a versatile cleaning product for laundry, dishwashing, and surface cleaning. It contains surfactants to effectively remove dirt, grease, and stains while being gentle on fabrics and surfaces.",
    "Safety Notice": "May cause eye irritation. Avoid eye and prolonged skin contact. Wear gloves during use. Rinse eyes with water if contacted. Keep out of reach of children. Do not mix with other cleaners unless specified.",
    "Source Country": ""
  },
  {
    "Product Name": "Optical Brightener Agent",
    "ID": "optical-brightener-agent",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "optical-brightener-agent.jpg",
    "Description": "Optical Brightener Agent is a fluorescent compound used in detergents and textiles to enhance fabric whiteness and brightness. It absorbs UV light and emits blue light, making fabrics appear cleaner.",
    "Safety Notice": "May cause skin or eye irritation in concentrated form. Avoid prolonged contact or dust inhalation. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from light.",
    "Source Country": "China"
  },
  {
    "Product Name": "Paraffin",
    "ID": "paraffin",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "paraffin.jpg",
    "Description": "Paraffin is a hydrocarbon used in cosmetics and detergents as an emollient, moisturizer, or lubricant. It is found in creams, lotions, and candles, providing a smooth texture and protective barrier.",
    "Safety Notice": "Flammable in liquid form. Avoid eye and prolonged skin contact. Use in well-ventilated areas. Keep away from heat and flames. Rinse with water if contacted. Store in a cool, dry place.",
    "Source Country": "Indonesia"
  },
  {
    "Product Name": "Petroleum Jelly",
    "ID": "petroleum-jelly",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "petroleum-jelly.webp",
    "Description": "Petroleum Jelly is a semi-solid mixture of hydrocarbons used as a moisturizer and protective barrier in cosmetics and skincare products. It is commonly applied in lotions, creams, and ointments to soothe dry skin, protect minor cuts, and enhance product texture.",
    "Safety Notice": "For external use only. Avoid eye contact. May cause irritation in sensitive individuals. Test for allergies before use. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": "India"
  },
  {
    "Product Name": "Phosphoric Acid",
    "ID": "phosphoric-acid",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS, FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "phosphoric-acid.jpg",
    "Description": "Phosphoric Acid is a versatile acid used as a pH adjuster and flavoring agent in food and beverages, and as a cleaning agent in detergents. It is effective in removing rust and scale in industrial applications and stabilizing formulations in cosmetics.",
    "Safety Notice": "Corrosive. Causes severe burns and eye damage. Harmful if swallowed or inhaled. Wear protective gear. Use in well-ventilated areas. Rinse with water if contacted. Store away from bases and metals.",
    "Source Country": "Belgium"
  },
  {
    "Product Name": "SLES 70%",
    "ID": "sles-70",
    "Brand Name": "170kg",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "sles-70.webp",
    "Description": "Sodium Lauryl Ether Sulfate (SLES) 70% is an anionic surfactant used in detergents, shampoos, and body washes for its excellent foaming and cleansing properties. It is widely used in personal care and household cleaning products for its ability to remove dirt and oils.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": "China"
  },
  {
    "Product Name": "Soap Noodles",
    "ID": "soap-noodles",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "soap-noodles.webp",
    "Description": "Soap Noodles are a semi-finished product used in the production of bar soaps. Made from a blend of oils and alkali, they serve as a base for formulating soaps with customized fragrances, colors, and additives for personal care and cleaning applications.",
    "Safety Notice": "May cause mild skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Silicate",
    "ID": "sodium-silicate",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "sodium-silicate.jpg",
    "Description": "Sodium Silicate, also known as water glass, is used in detergents and soaps as a stabilizer, corrosion inhibitor, and binding agent. It enhances cleaning efficiency and is also used in adhesives and construction materials.",
    "Safety Notice": "Corrosive. Causes skin and eye irritation. Wear protective gear. Use in well-ventilated areas. Rinse with water if contacted. Store in a tightly closed container away from acids.",
    "Source Country": "China"
  },
  {
    "Product Name": "Sodium Sulphate Anhydrous 99%",
    "ID": "sodium-sulphate-anhydrous-99",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "sodium-sulphate-anhydrous-99.webp",
    "Description": "Sodium Sulphate Anhydrous 99% is a white crystalline powder used as a filler and processing aid in powdered detergents. It enhances product stability and flowability, and is also used in textiles and glass production.",
    "Safety Notice": "May cause eye or respiratory irritation. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "China"
  },
  {
    "Product Name": "STPP 94%",
    "ID": "stpp-94",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "stpp-94.webp",
    "Description": "Sodium Tripolyphosphate (STPP) 94% is a phosphate compound used in detergents as a water softener and sequestering agent. It enhances cleaning efficiency by preventing mineral deposits and improving surfactant performance in household and industrial cleaners.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "China"
  },
  {
    "Product Name": "Tetrachloroethylene",
    "ID": "tetra-chloroethylene",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS",
    "Image Path": "tetra-chloroethylene.jpg",
    "Description": "Tetrachloroethylene, also known as perchloroethylene, is a colorless liquid solvent used in dry cleaning and industrial degreasing. It effectively removes oils, greases, and stains from fabrics and metal surfaces, making it valuable in cleaning applications.",
    "Safety Notice": "Harmful if inhaled or swallowed. May cause dizziness or skin irritation. Use in well-ventilated areas with protective gear. Avoid prolonged exposure. Store away from heat and flames.",
    "Source Country": "Belgium"
  },
  {
    "Product Name": "Titanium Dioxide",
    "ID": "titanium-dioxide",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS, PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "titanium-dioxide.webp",
    "Description": "Titanium Dioxide is a white pigment used in cosmetics, detergents, and paints for its excellent opacity and brightness. It is commonly found in sunscreens, creams, and cleaning products to enhance appearance and UV protection.",
    "Safety Notice": "May cause respiratory irritation if inhaled as dust. Avoid prolonged contact. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "China"
  },
  {
    "Product Name": "Zeolite 4A",
    "ID": "zeolite-4a",
    "Brand Name": "",
    "Category": "DETERGENT/COSMETICS CHEMICALS, FOOD/BEVERAGE/BREWERY CHEMICALS, PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "zeolite-4a.jpeg",
    "Description": "Zeolite 4A is a synthetic aluminosilicate used as a water softener and builder in detergents. It enhances cleaning efficiency by removing calcium and magnesium ions, and is also used in food processing and as a catalyst in industrial applications.",
    "Safety Notice": "May cause respiratory or eye irritation as dust. Avoid inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "China"
  },
  {
    "Product Name": "Aluminum Sulfate",
    "ID": "aluminum-sulfate",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS, TANNERY/SHOES CHEMICALS",
    "Image Path": "aluminum-sulfate.jpg",
    "Description": "Aluminum Sulfate is a coagulant used in water treatment for food and beverage processing and in tanning leather. It helps clarify water by removing impurities and is also used as a mordant in textile dyeing.",
    "Safety Notice": "May cause skin or eye irritation. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area away from bases.",
    "Source Country": "Kenya"
  },
  {
    "Product Name": "Antiscalant",
    "ID": "antiscalant",
    "Brand Name": "Genesis",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "antiscalant.webp",
    "Description": "Antiscalant is a chemical formulation used to prevent scale formation in water treatment systems, particularly in food and beverage processing. It inhibits the buildup of mineral deposits, ensuring efficient operation of boilers and cooling systems.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": "UK"
  },
  {
    "Product Name": "Antiscalant RO",
    "ID": "antiscalant-ro",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "antiscalant-ro.png",
    "Description": "Antiscalant RO is a specialized chemical used in reverse osmosis systems to prevent scale formation on membranes. It is critical in food and beverage processing to maintain water purity and system efficiency by inhibiting mineral deposits.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": "UK"
  },
  {
    "Product Name": "Activated Carbon",
    "ID": "activated-carbon",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "activated-carbon.png",
    "Description": "Activated Carbon is a porous material used in food and beverage processing for purification and decolorization. It effectively removes impurities, odors, and contaminants from liquids, making it ideal for water treatment and food refining.",
    "Safety Notice": "May cause respiratory irritation if inhaled as dust. Avoid inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "India"
  },
  {
    "Product Name": "Activated Bleaching Earth",
    "ID": "activated-bleaching-earth",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "activated-bleaching-earth.jpg",
    "Description": "Activated Bleaching Earth is a clay-based material used in food and beverage processing to refine edible oils and fats. It removes impurities, colors, and odors, improving the quality and appearance of oils for consumption.",
    "Safety Notice": "May cause respiratory or eye irritation as dust. Avoid inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "India"
  },
  {
    "Product Name": "Ammonium Bicarbonate 99%",
    "ID": "ammonium-bicarbonate-99",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS, TANNERY/SHOES CHEMICALS",
    "Image Path": "ammonium-bicarbonate-99.webp",
    "Description": "Ammonium Bicarbonate 99% is a food-grade leavening agent used in baking and beverage production. It releases carbon dioxide to aid dough rising and is also used in tanning processes for leather softening.",
    "Safety Notice": "May cause skin, eye, or respiratory irritation. Avoid inhaling dust or vapors. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from acids.",
    "Source Country": "China"
  },
  {
    "Product Name": "Ascorbic Acid",
    "ID": "ascorbic-acid",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "ascorbic-acid.webp",
    "Description": "Ascorbic Acid, also known as Vitamin C, is used as an antioxidant and preservative in food and beverages. It prevents oxidation, enhances shelf life, and is added to products like juices and canned goods for nutritional benefits.",
    "Safety Notice": "Generally safe but may cause irritation in concentrated form. Avoid eye contact or inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place.",
    "Source Country": "China"
  },
  {
    "Product Name": "Calcium Chloride 77% Food Grade",
    "ID": "calcium-chloride-77-food-grade",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "calcium-chloride-77-food-grade.jpg",
    "Description": "Calcium Chloride 77% Food Grade is a firming agent and preservative used in food processing to maintain texture in fruits and vegetables. It is also used in brewing and as a moisture absorbent in industrial applications.",
    "Safety Notice": "May cause skin or eye irritation. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area away from moisture.",
    "Source Country": "China"
  },
  {
    "Product Name": "Corn Starch",
    "ID": "corn-starch",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "corn-starch.webp",
    "Description": "Corn Starch is a fine powder derived from corn, used as a thickening agent in food and beverage processing. It is widely used in sauces, soups, and desserts to improve texture and consistency.",
    "Safety Notice": "Generally safe but may cause respiratory irritation if inhaled as dust. Avoid inhalation. Wear a dust mask if needed. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "Saudi"
  },
  {
    "Product Name": "Glucose",
    "ID": "glucose",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "glucose.webp",
    "Description": "Glucose is a simple sugar used as a sweetener and energy source in food and beverage production. It is commonly found in confectionery, beverages, and baking products, providing sweetness and aiding fermentation processes.",
    "Safety Notice": "Generally safe but may cause irritation in concentrated form. Avoid eye contact or inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place.",
    "Source Country": "India"
  },
  {
    "Product Name": "Hydrochloric Acid 35%",
    "ID": "hydrochloric-acid-35",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS, WATER TREATMENT CHEMICALS",
    "Image Path": "hydrochloric-acid-35.webp",
    "Description": "Hydrochloric Acid 35% is a strong acid used in food processing for pH adjustment and in water treatment for cleaning and descaling. It is also employed in industrial applications for metal cleaning and chemical synthesis.",
    "Safety Notice": "Highly corrosive. Causes severe burns and eye damage. Harmful if inhaled or swallowed. Wear protective gear. Use in well-ventilated areas. Rinse with water if contacted. Store away from bases.",
    "Source Country": "India"
  },
  {
    "Product Name": "Ion Exchangers",
    "ID": "ions-exchangers",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "ions-exchangers.webp",
    "Description": "Ion Exchangers are resins used in food and beverage processing for water softening and purification. They remove unwanted ions, such as calcium and magnesium, to improve water quality for production processes.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area away from moisture.",
    "Source Country": "China"
  },
  {
    "Product Name": "Manganese Sulphate",
    "ID": "manganese-sulphate",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "manganese-sulphate.webp",
    "Description": "Manganese Sulphate is a chemical compound used as a micronutrient in food and beverage processing to fortify products. It is also used in agriculture and industrial applications as a catalyst and nutrient supplement.",
    "Safety Notice": "May cause skin, eye, or respiratory irritation. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "India"
  },
  {
    "Product Name": "Nitric Acid",
    "ID": "nitric-acid",
    "Brand Name": "Brentag",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "nitric-acid.webp",
    "Description": "Nitric Acid is a strong acid used in food processing for cleaning and pH adjustment, and in industrial applications for metal etching and chemical synthesis. It is highly effective in removing organic residues and scale.",
    "Safety Notice": "Highly corrosive. Causes severe burns and eye damage. Harmful if inhaled or swallowed. Wear protective gear. Use in well-ventilated areas. Rinse with water if contacted. Store away from flammables.",
    "Source Country": "Belgium"
  },
  {
    "Product Name": "Poly Aluminum Chloride",
    "ID": "poly-aluminum-chloride",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "poly-aluminum-chloride.webp",
    "Description": "Poly Aluminum Chloride is a coagulant used in water treatment for food and beverage processing. It effectively removes suspended particles and impurities, ensuring clean water for production and other applications.",
    "Safety Notice": "May cause skin or eye irritation. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area away from bases.",
    "Source Country": "India"
  },
  {
    "Product Name": "Polyelectrolytes",
    "ID": "polyelectrolytes",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "polyelectrolytes.webp",
    "Description": "Polyelectrolytes are polymers used in food and beverage processing for water treatment and clarification. They aid in flocculation and sedimentation, improving the removal of impurities from liquids in production processes.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "India"
  },
  {
    "Product Name": "Skimmed Milk Powder",
    "ID": "skimmed-milk-powder",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "skimmed-milk-powder.jpg",
    "Description": "Skimmed Milk Powder is a dairy product used in food and beverage production for its nutritional content and versatility. It is added to baked goods, beverages, and confectionery to enhance flavor and texture.",
    "Safety Notice": "Generally safe but may cause respiratory irritation if inhaled as dust. Avoid inhalation. Wear a dust mask if needed. Store in a cool, dry place away from moisture.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Benzoate",
    "ID": "sodium-benzoate",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "sodium-benzoate.webp",
    "Description": "Sodium Benzoate is a preservative used in food and beverages to extend shelf life by inhibiting microbial growth. It is commonly found in soft drinks, sauces, and processed foods to maintain product safety and quality.",
    "Safety Notice": "Generally safe in small amounts but may cause irritation in concentrated form. Avoid eye contact or inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place.",
    "Source Country": "China"
  },
  {
    "Product Name": "Sodium Bicarbonate 99%",
    "ID": "sodium-bicarbonate-99",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "sodium-bicarbonate-99.webp",
    "Description": "Sodium Bicarbonate 99%, also known as baking soda, is a versatile compound used as a leavening agent in baking and a pH regulator in food and beverage processing. It is also used for cleaning and deodorizing.",
    "Safety Notice": "Generally safe but may cause skin or eye irritation in concentrated form. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "China"
  },
  {
    "Product Name": "Sodium Hypochlorite 10%",
    "ID": "sodium-hypochlorite-10",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "sodium-hypochlorite-10.jpeg",
    "Description": "Sodium Hypochlorite 10% is a liquid disinfectant used in food and beverage processing for sanitizing surfaces and equipment. It is also used in water treatment to eliminate bacteria and ensure hygiene in production facilities.",
    "Safety Notice": "Corrosive. Causes skin and eye irritation. Harmful if swallowed or inhaled. Wear protective gear. Use in well-ventilated areas. Rinse with water if contacted. Store away from acids and heat.",
    "Source Country": "China"
  },
  {
    "Product Name": "Sodium Meta Bisulphite 99%",
    "ID": "sodium-meta-bisulphite-99",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "sodium-meta-bisulphite-99.webp",
    "Description": "Sodium Meta Bisulphite 99% is a white crystalline powder used as a preservative and antioxidant in food and beverage processing. It prevents oxidation and microbial growth in products like wines, dried fruits, and juices, extending shelf life.",
    "Safety Notice": "May cause respiratory, skin, or eye irritation. Avoid inhaling dust or vapors. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from acids.",
    "Source Country": "China"
  },
  {
    "Product Name": "Tri Sodium Citrate",
    "ID": "tri-sodium-citrate",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS",
    "Image Path": "tri-sodium-citrate.webp",
    "Description": "Tri Sodium Citrate is a food-grade compound used as a buffering agent, emulsifier, and preservative in food and beverages. It stabilizes pH in products like cheeses, beverages, and jams, enhancing texture and shelf life.",
    "Safety Notice": "Generally safe but may cause irritation in concentrated form. Avoid eye contact or inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place.",
    "Source Country": "China"
  },
  {
    "Product Name": "Wetting Agent",
    "ID": "wetting-agent",
    "Brand Name": "",
    "Category": "FOOD/BEVERAGE/BREWERY CHEMICALS, TANNERY/SHOES CHEMICALS",
    "Image Path": "wetting-agent.webp",
    "Description": "Wetting Agent is a surfactant used in food processing to improve liquid dispersion and in tannery processes to enhance leather penetration. It reduces surface tension, aiding in uniform application and processing efficiency.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": "India"
  },
  {
    "Product Name": "Antifoaming Agent",
    "ID": "antifoaming-agent",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "antifoaming-agent.webp",
    "Description": "Antifoaming Agent is a chemical additive used in paints and coatings to prevent foam formation during production and application. It ensures smooth finishes and consistent quality in industrial processes.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from heat.",
    "Source Country": ""
  },
  {
    "Product Name": "Calcium Carbonate",
    "ID": "calcium-carbonate",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS, PLASTIC AND FOAM CHEMICALS",
    "Image Path": "calcium-carbonate.jpeg",
    "Description": "Calcium Carbonate is a white powder used as a filler and pigment in paints, plastics, and foams. It enhances opacity, durability, and cost-efficiency in coatings and polymer products.",
    "Safety Notice": "May cause respiratory or eye irritation as dust. Avoid inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Chrome Oxide",
    "ID": "chrome-oxide",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "chrome-oxide.jpg",
    "Description": "Chrome Oxide is a green pigment used in paints, coatings, and ceramics for its vibrant color and durability. It provides excellent UV resistance and stability in harsh environments.",
    "Safety Notice": "May cause respiratory or skin irritation as dust. Avoid inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Cobalt Octate",
    "ID": "cobalt-octate",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "cobalt-octate.webp",
    "Description": "Cobalt Octate is a drier used in paints and coatings to accelerate drying time. It catalyzes the oxidation process, ensuring faster curing and improved finish quality in alkyd-based paints.",
    "Safety Notice": "Flammable. May cause skin or eye irritation. Harmful if inhaled. Wear gloves and eye protection. Use in well-ventilated areas. Keep away from heat and flames. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Emulsifiers",
    "ID": "emulsifiers",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "emulsifiers.webp",
    "Description": "Emulsifiers are additives used in paints and coatings to stabilize emulsions, ensuring uniform dispersion of water and oil-based components. They improve product consistency and application performance.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Hexane/Acetone/Toluene",
    "ID": "hexane-acetone-toluene",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "hexane-acetone-toluene.webp",
    "Description": "Hexane, Acetone, and Toluene are solvents used in paints, coatings, and adhesives for dissolving resins and thinning formulations. They ensure smooth application and fast drying in industrial processes.",
    "Safety Notice": "Highly flammable. Harmful if inhaled or swallowed. Causes skin and eye irritation. Use in well-ventilated areas with protective gear. Keep away from heat and flames. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Iron Oxide (Black, Red, Yellow)",
    "ID": "iron-oxide-black-red-yellow",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "iron-oxide-black-red-yellow.webp",
    "Description": "Iron Oxide pigments (Black, Red, Yellow) are used in paints, coatings, and construction materials for their vibrant colors and durability. They provide excellent UV resistance and color stability.",
    "Safety Notice": "May cause respiratory or eye irritation as dust. Avoid inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Kerosene",
    "ID": "kerosene",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "kerosene.jpg",
    "Description": "Kerosene is a hydrocarbon solvent used in paints and coatings as a thinner and cleaner. It aids in viscosity control and surface preparation, ensuring smooth application in industrial settings.",
    "Safety Notice": "Highly flammable. Harmful if inhaled or swallowed. Causes skin irritation. Use in well-ventilated areas with protective gear. Keep away from heat and flames. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Mica Powder",
    "ID": "mica-powder",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "mica-powder.jpg",
    "Description": "Mica Powder is a shimmering pigment used in paints, coatings, and cosmetics to add sparkle and pearlescent effects. It enhances aesthetic appeal and durability in decorative finishes.",
    "Safety Notice": "May cause respiratory or eye irritation as dust. Avoid inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "NC Thinner",
    "ID": "nc-thinner",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "nc-thinner.webp",
    "Description": "NC Thinner is a solvent blend used in nitrocellulose-based paints and lacquers to adjust viscosity and ensure smooth application. It promotes fast drying and uniform finishes in coatings.",
    "Safety Notice": "Highly flammable. Harmful if inhaled or swallowed. Causes skin and eye irritation. Use in well-ventilated areas with protective gear. Keep away from heat and flames. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Solvents",
    "ID": "solvents",
    "Brand Name": "",
    "Category": "PAINT/PIGMENT AND SOLVENTS",
    "Image Path": "solvents.jpg",
    "Description": "Solvents are chemical substances used in paints, coatings, and adhesives to dissolve resins and adjust viscosity. They ensure smooth application, fast drying, and high-quality finishes in industrial processes.",
    "Safety Notice": "Highly flammable. Harmful if inhaled or swallowed. Causes skin and eye irritation. Use in well-ventilated areas with protective gear. Keep away from heat and flames. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "LDPE",
    "ID": "ldpe",
    "Brand Name": "",
    "Category": "PLASTIC AND FOAM CHEMICALS",
    "Image Path": "ldpe.jpg",
    "Description": "Low-Density Polyethylene (LDPE) is a flexible plastic used in film production, packaging, and foam manufacturing. Its durability and flexibility make it ideal for plastic bags, containers, and insulation.",
    "Safety Notice": "Non-hazardous in solid form but may release fumes if heated. Avoid inhalation of fumes. Wear gloves and eye protection during processing. Store in a cool, dry place away from heat.",
    "Source Country": "Saudi"
  },
  {
    "Product Name": "PET",
    "ID": "pet",
    "Brand Name": "",
    "Category": "PLASTIC AND FOAM CHEMICALS",
    "Image Path": "pet.webp",
    "Description": "Polyethylene Terephthalate (PET) is a strong, lightweight plastic used in bottles, containers, and packaging films. It is widely used in the production of food-grade containers and textiles due to its clarity and recyclability.",
    "Safety Notice": "Non-hazardous in solid form but may release fumes if heated. Avoid inhalation of fumes. Wear gloves and eye protection during processing. Store in a cool, dry place away from heat.",
    "Source Country": "China"
  },
  {
    "Product Name": "HDPE",
    "ID": "hdpe",
    "Brand Name": "",
    "Category": "PLASTIC AND FOAM CHEMICALS",
    "Image Path": "hdpe.jpg",
    "Description": "High-Density Polyethylene (HDPE) is a durable plastic used in containers, pipes, and packaging. Its strength and chemical resistance make it suitable for industrial and consumer applications, including bottles and bags.",
    "Safety Notice": "Non-hazardous in solid form but may release fumes if heated. Avoid inhalation of fumes. Wear gloves and eye protection during processing. Store in a cool, dry place away from heat.",
    "Source Country": "Saudi"
  },
  {
    "Product Name": "Master Batch",
    "ID": "master-batch",
    "Brand Name": "",
    "Category": "PLASTIC AND FOAM CHEMICALS",
    "Image Path": "master-batch.jpg",
    "Description": "Master Batch is a concentrated mixture of pigments or additives used to color or enhance the properties of plastics. It is used in plastic manufacturing to achieve uniform color and improved performance.",
    "Safety Notice": "May cause respiratory or eye irritation as dust. Avoid inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "Dubai"
  },
  {
    "Product Name": "Methylene Chloride",
    "ID": "methylene-chloride",
    "Brand Name": "",
    "Category": "PLASTIC AND FOAM CHEMICALS",
    "Image Path": "methylene-chloride.webp",
    "Description": "Methylene Chloride is a solvent used in plastic and foam production for dissolving resins and adhesives. It is also used in paint stripping and degreasing due to its strong solvency properties.",
    "Safety Notice": "Harmful if inhaled or swallowed. Causes skin and eye irritation. Use in well-ventilated areas with protective gear. Avoid prolonged exposure. Store away from heat and flames.",
    "Source Country": ""
  },
  {
    "Product Name": "Polyol",
    "ID": "polyol",
    "Brand Name": "",
    "Category": "PLASTIC AND FOAM CHEMICALS",
    "Image Path": "polyol.webp",
    "Description": "Polyol is a key component in polyurethane foam production, used in plastics and foam manufacturing for insulation, cushioning, and coatings. It provides flexibility and durability in end products.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from heat and oxidizers.",
    "Source Country": ""
  },
  {
    "Product Name": "PP Raffia",
    "ID": "pp-raffia",
    "Brand Name": "",
    "Category": "PLASTIC AND FOAM CHEMICALS",
    "Image Path": "pp-raffia.webp",
    "Description": "Polypropylene (PP) Raffia is a strong, flexible plastic used in woven bags, ropes, and packaging materials. Its high tensile strength makes it ideal for industrial and agricultural applications.",
    "Safety Notice": "Non-hazardous in solid form but may release fumes if heated. Avoid inhalation of fumes. Wear gloves and eye protection during processing. Store in a cool, dry place away from heat.",
    "Source Country": ""
  },
  {
    "Product Name": "PVC Resin",
    "ID": "pvc-resin",
    "Brand Name": "",
    "Category": "PLASTIC AND FOAM CHEMICALS",
    "Image Path": "pvc-resin.webp",
    "Description": "PVC Resin (Polyvinyl Chloride) is a versatile plastic used in pipes, cables, and packaging. Its durability and chemical resistance make it suitable for construction, medical, and consumer goods applications.",
    "Safety Notice": "May cause respiratory or eye irritation as dust. Avoid inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": "China"
  },
  {
    "Product Name": "T.D.I",
    "ID": "tdi",
    "Brand Name": "",
    "Category": "PLASTIC AND FOAM CHEMICALS",
    "Image Path": "tdi.webp",
    "Description": "Toluene Diisocyanate (T.D.I) is a key chemical used in the production of polyurethane foams and plastics. It is essential for manufacturing flexible foams for cushions, mattresses, and automotive applications.",
    "Safety Notice": "Harmful if inhaled or in contact with skin. Causes severe eye and respiratory irritation. Wear protective gear and use in well-ventilated areas. Rinse with water if contacted. Store in a cool, dry place away from heat.",
    "Source Country": "China"
  },
  {
    "Product Name": "Ammonia Solution",
    "ID": "ammonia-solution",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "ammonia-solution.webp",
    "Description": "Ammonia Solution is a water-based solution of ammonia used in tannery processes for pH adjustment and leather softening. It aids in hair removal and cleaning during leather production.",
    "Safety Notice": "Corrosive. Causes severe skin burns and eye damage. Harmful if inhaled. Wear protective gear and use in well-ventilated areas. Rinse with water if contacted. Store away from acids and heat.",
    "Source Country": "China"
  },
  {
    "Product Name": "Degreasing Agent",
    "ID": "degreasing-agent",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "degreasing-agent.webp",
    "Description": "Degreasing Agent is a surfactant-based chemical used in tanneries to remove oils and fats from hides and skins. It ensures cleaner leather surfaces for further processing and dyeing.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": "China"
  },
  {
    "Product Name": "Formic Acid 85%",
    "ID": "formic-acid-85",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "formic-acid-85.webp",
    "Description": "Formic Acid 85% is a strong organic acid used in tanneries for leather pickling and pH adjustment. It enhances dye penetration and preservation in leather processing.",
    "Safety Notice": "Corrosive. Causes severe burns and eye damage. Harmful if inhaled or swallowed. Wear protective gear and use in well-ventilated areas. Rinse with water if contacted. Store away from bases.",
    "Source Country": ""
  },
  {
    "Product Name": "Oxalic Acid 99%",
    "ID": "oxalic-acid-99",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "oxalic-acid-99.webp",
    "Description": "Oxalic Acid 99% is a crystalline acid used in tanneries for bleaching and cleaning leather. It removes stains and rust, improving the appearance and quality of leather products.",
    "Safety Notice": "Toxic if swallowed or inhaled. Causes severe skin and eye irritation. Wear protective gear and use in well-ventilated areas. Rinse with water if contacted. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Soda Ash 99%",
    "ID": "soda-ash-99",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "soda-ash-99.webp",
    "Description": "Soda Ash 99% (Sodium Carbonate) is used in tanneries as a pH regulator and softening agent. It aids in leather processing by neutralizing acids and enhancing dye uptake.",
    "Safety Notice": "May cause skin, eye, or respiratory irritation. Avoid inhaling dust. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Formate 97%",
    "ID": "sodium-formate-97",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "sodium-formate-97.webp",
    "Description": "Sodium Formate 97% is a white crystalline powder used in tanneries as a reducing agent and pH buffer. It enhances leather quality by aiding in chrome tanning and dye fixation.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Bicarbonate 99%",
    "ID": "sodium-bicarbonate-99",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "sodium-bicarbonate-99.jpg",
    "Description": "Sodium Bicarbonate 99% is used in tanneries as a pH regulator and neutralizing agent. It helps control acidity during leather processing, improving the efficiency of tanning and dyeing.",
    "Safety Notice": "Generally safe but may cause skin or eye irritation in concentrated form. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Meta Bisulphite",
    "ID": "sodium-meta-bisulphite",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "sodium-meta-bisulphite.jpg",
    "Description": "Sodium Meta Bisulphite is a reducing agent used in tanneries for leather preservation and dehairing. It prevents oxidation and microbial growth, ensuring high-quality leather production.",
    "Safety Notice": "May cause respiratory, skin, or eye irritation. Avoid inhaling dust or vapors. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from acids.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Sulfohydrate",
    "ID": "sodium-sulfohydrate",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "sodium-sulfohydrate.jpg",
    "Description": "Sodium Sulfohydrate, also known as sodium hydrosulfide, is used in tanneries for dehairing and leather softening. It aids in removing hair from hides, facilitating smoother leather processing.",
    "Safety Notice": "Corrosive. Causes severe skin burns and eye damage. Harmful if inhaled. Wear protective gear and use in well-ventilated areas. Rinse with water if contacted. Store away from acids and heat.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Sulphide 60%",
    "ID": "sodium-sulphide-60",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "sodium-sulphide-60.webp",
    "Description": "Sodium Sulphide 60% is a chemical used in tanneries for dehairing and leather processing. It effectively removes hair and impurities from hides, preparing them for tanning.",
    "Safety Notice": "Corrosive. Causes severe skin burns and eye damage. Harmful if inhaled or swallowed. Wear protective gear and use in well-ventilated areas. Rinse with water if contacted. Store away from acids.",
    "Source Country": ""
  },
  {
    "Product Name": "Sulphuric Acid 98%",
    "ID": "sulphuric-acid-98",
    "Brand Name": "",
    "Category": "TANNERY/SHOES CHEMICALS",
    "Image Path": "sulphuric-acid-98.jpg",
    "Description": "Sulphuric Acid 98% is a strong acid used in tanneries for leather pickling and pH adjustment. It enhances tanning processes and improves leather quality by aiding in dye penetration.",
    "Safety Notice": "Highly corrosive. Causes severe burns and eye damage. Harmful if inhaled or swallowed. Wear protective gear and use in well-ventilated areas. Rinse with water if contacted. Store away from bases.",
    "Source Country": "Kenya"
  },
  {
    "Product Name": "Acetic Acid 99.7%",
    "ID": "acetic-acid-99-7",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "acetic-acid-99-7.jpg",
    "Description": "Acetic Acid 99.7% is a strong organic acid used in textile processing for pH adjustment and dye fixation. It enhances color vibrancy and ensures uniform dyeing of fabrics.",
    "Safety Notice": "Corrosive. Causes severe burns and eye damage. Harmful if inhaled or swallowed. Wear protective gear and use in well-ventilated areas. Rinse with water if contacted. Store away from bases.",
    "Source Country": ""
  },
  {
    "Product Name": "Anti Foam/Dispersing Agent",
    "ID": "anti-foam-dispersing-agent",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "anti-foam-dispersing-agent.webp",
    "Description": "Anti Foam/Dispersing Agent is used in textile processing to prevent foam formation and ensure uniform dispersion of dyes and chemicals. It improves process efficiency and fabric quality.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from heat.",
    "Source Country": ""
  },
  {
    "Product Name": "Detergent/Wetting Agent",
    "ID": "detergent-wetting-agent",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "detergent-wetting-agent.png",
    "Description": "Detergent/Wetting Agent is used in textile processing to enhance the wetting and cleaning of fabrics. It reduces surface tension, ensuring better penetration of dyes and chemicals.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Dyestuffs",
    "ID": "dyestuffs",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "dyestuffs.jpg",
    "Description": "Dyestuffs are colored compounds used in textiles to impart vibrant, long-lasting colors to fabrics. They are designed for various dyeing processes, ensuring high colorfastness and uniformity.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Lacquer Along with Sensitizer",
    "ID": "lacquer-along-with-sensitizer",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "lacquer-sensitizer.webp",
    "Description": "Lacquer Along with Sensitizer is used in textile printing to create glossy finishes and enhance print durability. The sensitizer aids in curing the lacquer for better adhesion to fabrics.",
    "Safety Notice": "May cause skin or eye irritation. Flammable. Wear gloves and eye protection. Use in well-ventilated areas. Keep away from heat and flames. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Peroxide Killer",
    "ID": "peroxide-killer",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "peroxide-killer.webp",
    "Description": "Peroxide Killer is a chemical used in textile processing to neutralize residual hydrogen peroxide after bleaching. It ensures fabric safety and prepares textiles for dyeing.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from oxidizers.",
    "Source Country": ""
  },
  {
    "Product Name": "Pigment Binder",
    "ID": "pigment-binder",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "pigment-binder.webp",
    "Description": "Pigment Binder is used in textile printing to fix pigments onto fabrics, ensuring color durability and resistance to washing. It enhances the vibrancy and longevity of printed designs.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from heat.",
    "Source Country": ""
  },
  {
    "Product Name": "Pigment Thickener",
    "ID": "pigment-thickener",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "pigment-thickener.webp",
    "Description": "Pigment Thickener is used in textile printing to increase the viscosity of pigment pastes, ensuring precise application and sharp print designs. It improves print quality and consistency.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from heat.",
    "Source Country": ""
  },
  {
    "Product Name": "Plastisol Pigments",
    "ID": "plastisol-pigments",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "plastisol-pigments.png",
    "Description": "Plastisol Pigments are used in textile screen printing to create vibrant, durable designs on fabrics. They are mixed with plastisol inks for high-opacity and flexible prints.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Printing Pigments",
    "ID": "printing-pigments",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "printing-pigments.jpg",
    "Description": "Printing Pigments are used in textile printing to add vibrant colors to fabrics. They provide excellent colorfastness and are suitable for various printing techniques, ensuring high-quality designs.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Sequestering Agent",
    "ID": "sequestering-agent",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "sequestering-agent.webp",
    "Description": "Sequestering Agent is used in textile processing to bind metal ions, preventing interference with dyeing and bleaching processes. It ensures uniform color and fabric quality.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from heat.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Carbonate",
    "ID": "sodium-carbonate",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "sodium-carbonate.jpg",
    "Description": "Sodium Carbonate, also known as soda ash, is used in textile processing as a pH regulator and dyeing auxiliary. It enhances dye fixation and fabric cleaning efficiency.",
    "Safety Notice": "May cause skin, eye, or respiratory irritation. Avoid inhaling dust. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Hydrosulphite 85%",
    "ID": "sodium-hydrosulphite-85",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "sodium-hydrosulphite-85.jpg",
    "Description": "Sodium Hydrosulphite 85% is a reducing agent used in textile dyeing and bleaching to remove excess dyes and improve colorfastness. It is essential for achieving uniform fabric colors.",
    "Safety Notice": "May cause respiratory or skin irritation. Flammable in contact with water. Wear gloves and eye protection. Use in well-ventilated areas. Store in a dry, well-ventilated area away from moisture.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Sulphate/Glauber Salt",
    "ID": "sodium-sulphate-glauber-salt",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "sodium-sulphate-glauber-salt.jpg",
    "Description": "Sodium Sulphate, also known as Glauber Salt, is used in textile dyeing as a leveling agent to promote uniform dye uptake. It enhances color consistency and dyeing efficiency.",
    "Safety Notice": "May cause eye or respiratory irritation. Avoid inhaling dust. Wear gloves and eye protection. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Softener/Stiffener",
    "ID": "softener-stiffener",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "softener-stiffener.webp",
    "Description": "Softener/Stiffener is used in textile finishing to adjust fabric texture, providing either softness or rigidity. It enhances fabric feel and appearance for various applications.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place away from heat.",
    "Source Country": ""
  },
  {
    "Product Name": "Stain Remover/EDTA",
    "ID": "stain-remover-edta",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "stain-remover-edta.jpg",
    "Description": "Stain Remover/EDTA is a chelating agent used in textiles to remove metal ions and stains. It enhances cleaning and prevents discoloration during dyeing and washing processes.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves and eye protection. Rinse with water if contacted. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Textile Dyes",
    "ID": "textile-dyes",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "textile-dyes.jpg",
    "Description": "Textile Dyes are colorants used to impart vibrant, long-lasting colors to fabrics. They are designed for various fibers and dyeing techniques, ensuring high colorfastness and uniformity.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Textile Pigments",
    "ID": "textile-pigments",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "textile-pigments.jpg",
    "Description": "Textile Pigments are used in textile printing to create vibrant, durable designs on fabrics. They offer excellent opacity and are suitable for various printing techniques.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact or dust inhalation. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Wetting Agent",
    "ID": "wetting-agent",
    "Brand Name": "",
    "Category": "TEXTILE CHEMICALS",
    "Image Path": "wetting-agent.webp",
    "Description": "Wetting Agent is a surfactant used in textile processing to enhance the wetting and penetration of dyes and chemicals into fabrics. It improves dyeing uniformity and process efficiency.",
    "Safety Notice": "May cause skin or eye irritation. Avoid prolonged contact. Wear gloves and eye protection. Rinse with water if contacted. Keep out of reach of children. Store in a cool, dry place.",
    "Source Country": ""
  },
  {
    "Product Name": "Copper Sulphate",
    "ID": "copper-sulphate",
    "Brand Name": "",
    "Category": "WATER TREATMENT CHEMICALS, TANNERY/SHOES CHEMICALS",
    "Image Path": "copper-sulphate.jpg",
    "Description": "Copper Sulphate is a chemical used in water treatment to control algae and in tanneries as a mordant for dyeing leather. It enhances color fixation and water quality.",
    "Safety Notice": "Toxic if swallowed. Causes skin and eye irritation. Wear gloves and eye protection. Avoid inhaling dust. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Lime (Hydrated)",
    "ID": "lime-hydrated",
    "Brand Name": "",
    "Category": "WATER TREATMENT CHEMICALS",
    "Image Path": "lime-hydrated.webp",
    "Description": "Hydrated Lime (Calcium Hydroxide) is used in water treatment to adjust pH and remove impurities. It aids in water softening and clarification for industrial and municipal applications.",
    "Safety Notice": "May cause skin, eye, or respiratory irritation. Avoid inhaling dust. Wear gloves, eye protection, and a dust mask. Rinse with water if contacted. Store in a dry, well-ventilated area.",
    "Source Country": ""
  },
  {
    "Product Name": "Sodium Hypochlorite 12%",
    "ID": "sodium-hypochlorite-12",
    "Brand Name": "",
    "Category": "WATER TREATMENT CHEMICALS",
    "Image Path": "sodium-hypochlorite-12.webp",
    "Description": "Sodium Hypochlorite 12% is a liquid disinfectant used in water treatment to eliminate bacteria and pathogens. It is also used for sanitizing surfaces in industrial settings.",
    "Safety Notice": "Corrosive. Causes skin and eye irritation. Harmful if swallowed or inhaled. Wear protective gear. Use in well-ventilated areas. Rinse with water if contacted. Store away from acids and heat.",
    "Source Country": ""
  }
]
